#ifndef ROFLS_H
#define ROFLS_H

static const char* const MATAN_PHRASES[] =
{
    "Я чихнул на клавиатуру и пока вытирал получилось это",
    "Старый советский бутерброд, забытый за холодильником подсказал мне, что",
    "Каждый раз когда я засыпаю, мне снится",
    "Как два пальца обоссать",
    "Заметим, что",
    "Невнимательный читатель уже перестал читать, а внимательный уже перестал жить, \n"
    "я тут один, одинокая функция TexPrintSubtree...\n"
    "Я работать 1 миска рис 1 кошка жена день, но это не приносить радость. Удар!\n",
    "Доказательство данного факта оставим в качестве упражнения на подумать",
    "В детском саду мне сказали",
    "Однажды Конфуций сказал: нихао, а потом Петрович добавил:",
    "Это было в моей шпаргалке в кр по матану",
    "Очевидно, что",
    "Неочевидно (но всем насрать), что",
    "Никому не очевидно, что",
    "В качестве упражнения я подтягиваюсь, а в качестве зарядки я заряжаюсь, а в качестве беруна производных мне нет равных",
    "Совершенно очевидно, что когда в пятерочке была акция, кузя лакомкин стоил ровно такое количество рублей",
    "Без труда можно понять, что",
    "Во время подсчета мной была допущена одна ошибка, оставим ее нахождение в качестве упражнения на совести каждого читателя",
};

const int MATAN_PHRASES_N = sizeof(MATAN_PHRASES) / sizeof(MATAN_PHRASES[0]);

#endif // ROFLS_H
